ermaccer/MK11Hook/MK11Hook/code/mk11menu.cpp
#include "mk11menu.h"
#include <Windows.h>
#include "mk10utils.h"
#include "mk11.h"
#include <iostream>
#include "..\imgui\imgui.h"
#include "eSettingsManager.h"
#include "..\utils\MemoryMgr.h"
#include "eNotifManager.h"
#include "MKCamera.h"
#include <math.h>
#include "helper/eAbilityNames.h"
#include "helper/eKeyboardMan.h"
#include "..\eDirectX11Hook.h"
#include "GameInfo.h"
#include "Krypt.h"
#include "MKObject.h"

static int64 timer = GetTickCount64();
static int64 func_timer = GetTickCount64();
char textBuffer[260] = {};


const char* szCharacters[] = {
	// place npcs first for easy access
	"CHAR_Cyrax",
	"CHAR_Sektor",
	"CHAR_FireGod",
	"CHAR_Kronika",

	// rest of the cast
	"CHAR_Baraka",
	"CHAR_Cage",
	"CHAR_Cassie",
	"CHAR_Cetrion",
	"CHAR_DVorah",
	"CHAR_ErronBlack",
	"CHAR_Jacqui",
	"CHAR_Jade",
	"CHAR_Jax",
	"CHAR_Kabal",
	"CHAR_Kano",
	"CHAR_Kitana",
	"CHAR_Kollector",
	"CHAR_Kotal",
	"CHAR_KungLao",
	"CHAR_LiuKang",
	"CHAR_Noob",
	"CHAR_Raiden",
	"CHAR_Scorpion",
	"CHAR_Skarlet",
	"CHAR_Sonya",
	"CHAR_SubZero",
	"CHAR_Terminas",
	// story (512 in total) fun ones in front
	"SEK_Story_Upgraded",
	"KRO_Story_Crown",
	"FRO_Story_Robe",
	"BARpr_Story",
	"BAR_A",
	"BAR_B",
	"BAR_C",
	"BAR_D",
	"BAR_E",
	"BAR_F",
	"BAR_F1",
	"BAR_G",
	"BAR_H",
	"CAS_A",
	"CAS_A1",
	"CAS_B",
	"CAS_C",
	"CAS_D",
	"CAS_E",
	"CAS_F",
	"CAS_G",
	"CAS_H",
	"CAS_H1",
	"CAS_I",
	"CAS_NoGlasses",
	"CAS_Story",
	"CAS_Story_SF",
	"CAS_Story_SF_NoHelmet",
	"CET_A",
	"CET_B",
	"CET_C",
	"CET_D",
	"CET_E",
	"CET_F",
	"CET_G",
	"CET_Story",
	"CET_Story_Dark",
	"FRO_A",
	"FRO_A1",
	"FRO_B",
	"FRO_C",
	"FRO_D",
	"FRO_E",
	"FRO_F",
	"FRO_G",
	"FRO_NoMask",
	"FRO_Story",
	"DVO_A",
	"DVO_A1_KL",
	"DVO_B",
	"DVO_B1",
	"DVO_C",
	"DVO_D",
	"DVO_E",
	"DVO_F",
	"DVO_G",
	"DVO_Story",
	"ERRpa_Story",
	"ERRpa_Story_Fight",
	"ERRpr_Story",
	"ERRpr_Story_Fight",
	"ERRpr_Story_Mask",
	"ERRpr_Story_Mask_Fight",
	"ERR_A",
	"ERR_B",
	"ERR_C",
	"ERR_C1",
	"ERR_D",
	"ERR_E",
	"ERR_F",
	"ERR_G",
	"ERR_H",
	"JAC_A",
	"JAC_A1",
	"JAC_B",
	"JAC_C",
	"JAC_D",
	"JAC_E",
	"JAC_F",
	"JAC_G",
	"JAC_H",
	"JAC_Story",
	"JAC_Story_Crown",
	"JAC_Story_SF",
	"JAC_Story_SF_NoMic",
	"JADpa_Story",
	"JADpa_Story_NoHood",
	"JADpa_Story_NoStaff",
	"JADrv_Story",
	"JADrv_Story_KronikaUpgraded",
	"JADrv_Story_KronikaUpgraded_NoMask",
	"JADrv_Story_NoMask",
	"JADrv_Story_NoStaff",
	"JAD_A",
	"JAD_B",
	"JAD_B1",
	"JAD_C",
	"JAD_D",
	"JAD_DefaultPreset_02",
	"JAD_DefaultPreset_03",
	"JAD_E",
	"JAD_E1",
	"JAD_F",
	"JAD_G",
	"JAD_H",
	"JAD_I",
	"JAD_WitchNoMask",
	"JAXpa_Story",
	"JAXpa_Story_Crown",
	"JAXpr_KronikaUpgraded",
	"JAXpr_Story",
	"JAX_A",
	"JAX_B",
	"JAX_C",
	"JAX_D",
	"JAX_E",
	"JAX_F",
	"JOHpa_Story",
	"JOHpa_Story_Collar",
	"JOHpa_Story_Fight",
	"JOHpa_Story_NoGlasses",
	"JOHpa_Story_NoJacket",
	"JOHpa_Story_Scar",
	"JOHpr_Story",
	"JOHpr_Story_Glasses",
	"JOHpr_Story_Scar",
	"JOH_A",
	"JOH_B",
	"JOH_B1",
	"JOH_C",
	"JOH_D",
	"JOH_DefaultPreset_02",
	"JOH_DefaultPreset_03",
	"JOH_E",
	"JOH_F",
	"JOH_H",
	"JOH_I",
	"JOH_J1",
	"JOH_J2",
	"JOH_Mime",
	"JOH_Movie",
	"JOH_NoGlasses",
	"KABpa_Story",
	"KABrv_Story",
	"KAB_A",
	"KAB_B",
	"KAB_C",
	"KAB_D",
	"KAB_DefaultPreset_02",
	"KAB_DefaultPreset_03",
	"KAB_D_Test",
	"KAB_E",
	"KAB_F",
	"KAB_G",
	"KAB_G1",
	"KANpa_Story",
	"KANpa_Story_Fight",
	"KANpr_Story",
	"KANpr_Story_Fight",
	"KAN_A",
	"KAN_A1",
	"KAN_B",
	"KAN_C",
	"KAN_D",
	"KAN_E",
	"KAN_F",
	"KAN_G",
	"KAN_H",
	"KAN_I",
	"KITpa_Story",
	"KITpa_Story_Goddess",
	"KITpa_Story_NoMask",
	"KITrv_Story",
	"KITrv_Story_KronikaUpgraded",
	"KITrv_Story_KronikaUpgraded_NoMask",
	"KITrv_Story_Mask",
	"KITrv_Story_NoEyeMask",
	"KIT_A",
	"KIT_B",
	"KIT_B1",
	"KIT_C",
	"KIT_D",
	"KIT_E",
	"KIT_F",
	"KIT_H",
	"KIT_I",
	"KIT_J",
	"KIT_K",
	"KOT_A",
	"KOT_A1",
	"KOT_B",
	"KOT_C",
	"KOT_E",
	"KOT_F",
	"KOT_G",
	"KOT_GearTest",
	"KOT_SKIN_D",
	"KOT_Story",
	"KOT_Story_NoHelmet",
	"KOL_A",
	"KOL_B",
	"KOL_C",
	"KOL_D",
	"KOL_D1",
	"KOL_E",
	"KOL_F",
	"KOL_Story",
	"KOL_Story_Fight",
	"KOL_Story_noBackpack",
	"KUNpa_Story",
	"KUNpa_Story_Disguise",
	"KUNpa_Story_NoHat",
	"KUNrv_Story",
	"KUNrv_Story_KronikaUpgraded",
	"KUNrv_Story_NoHat",
	"KUN_C1",
	"KUN_A",
	"KUN_A_SetB",
	"KUN_B",
	"KUN_C",
	"KUN_D",
	"KUN_E",
	"KUN_F",
	"KUN_G",
	"KUN_H",
	"KUN_I",
	"LIUpa_Story",
	"LIUpa_Story_Disguise",
	"LIUpa_Story_Shirtless",
	"LIUrv_Story",
	"LIU_A",
	"LIU_B",
	"LIU_C",
	"LIU_D",
	"LIU_D2",
	"LIU_E",
	"LIU_F",
	"LIU_G",
	"LIU_H",
	"LIU_I",
	"LIU_J",
	"LIU_Story_SoulDrain",
	"LIU_Story_Montage_A",
	"LIU_Story_Montage_B",
	"LIU_Story_Montage_C",
	"LIU_Story_Montage_D",
	"LIU_Story_Montage_E",
	"LIU_Story_Montage_F",
	"LIU_Story_Montage_G",
	"LIU_Story_Montage_H",
	"LIU_Story_Montage_I",
	"LIU_Story_Montage_J",
	"LIU_Story_Montage_K",
	"LIU_Story_Montage_L",
	"LIU_Story_Montage_M",
	"LIU_Story_Montage_N",
	"LIU_Story_Montage_O",
	"LIU_Story_Montage_P",
	"LIU_Story_Montage_Q",
	"LIU_Story_Montage_R",
	"NOO_NoMask",
	"NOO_SKIN_A",
	"NOO_SKIN_A1",
	"NOO_SKIN_A2",
	"NOO_SKIN_B",
	"NOO_SKIN_B1",
	"NOO_SKIN_C",
	"NOO_SKIN_D",
	"NOO_SKIN_E",
	"NOO_SKIN_F",
	"NOO_SKIN_G",
	"NOO_SKIN_H",
	"NOO_SKIN_I",
	"NOO_Story",
	"NOO_Story_NoSickle",
	"RAIpa_Story",
	"RAIpa_Story_Fight",
	"RAIpa_Story_Mortal",
	"RAIpa_Story_Mortal_WithHat",
	"RAIpa_Story_Red_Fight",
	"RAIpr_Story",
	"RAIpr_Story_Fight",
	"RAIpr_Story_NoAmulet",
	"RAI_A",
	"RAI_A1",
	"RAI_B",
	"RAI_C",
	"RAI_D",
	"RAI_DefaultPreset_02",
	"RAI_DefaultPreset_03",
	"RAI_E",
	"RAI_F",
	"RAI_G",
	"RAI_H1",
	"RAI_Movie",
	"RAIpa_Story_Montage_A",
	"RAIpa_Story_Montage_B",
	"RAIpa_Story_Montage_C",
	"RAIpa_Story_Montage_D",
	"RAIpa_Story_Montage_E",
	"RAIpa_Story_Montage_F",
	"RAIpa_Story_Montage_G",
	"RAIpa_Story_Montage_H",
	"RAIpa_Story_Montage_I",
	"RAIpa_Story_Montage_J",
	"RAIpa_Story_Montage_K",
	"RAIpa_Story_Montage_L",
	"RAIpa_Story_Montage_M",
	"RAIpa_Story_Montage_N",
	"RAIpa_Story_Montage_O",
	"RAIpa_Story_Montage_P",
	"RAIpa_Story_Montage_Q",
	"RAIpa_Story_Montage_R",
	"RAIpa_Story_SoulDrain",
	"RAIpa_Story_SoulDrain_NoHat",
	"SCOpa_Story",
	"SCOpa_Story_NoSwords",
	"SCOpr_Story",
	"SCOpr_Story_NoSwords",
	"SCO_A",
	"SCO_A1",
	"SCO_A_NoMask",
	"SCO_B",
	"SCO_C",
	"SCO_D",
	"SCO_E",
	"SCO_F",
	"SCO_H",
	"SCO_H1",
	"SCO_I",
	"SHA_A",
	"SHA_B",
	"SHA_C",
	"SHA_D",
	"SHA_E",
	"SHA_F",
	"SHA_GearTest",
	"SHA_Story",
	"SHA_Story_EyeCut",
	"SHA_Story_NoHelmet",
	"SHA_Story_SoulDrain",
	"SHA_test",
	"SKApa_Story",
	"SKA_A",
	"SKA_B",
	"SKA_B_NoMask",
	"SKA_C",
	"SKA_D",
	"SKA_D2",
	"SKA_E",
	"SKA_F",
	"SKA_G",
	"SKA_H",
	"SKA_I",
	"SKA_J",
	"SKA_No_Mask",
	"SKA_SKIN_B_Blue",
	"SONpa_Story",
	"SONpa_Story_NoGloves",
	"SONpr_Story",
	"SONpr_Story_Fight",
	"SONpr_Story_SF",
	"SONpr_Story_SF_NoHat",
	"SON_A",
	"SON_B",
	"SON_C",
	"SON_D",
	"SON_E",
	"SON_F",
	"SON_FACE_C_TEST",
	"SON_H",
	"SON_I",
	"SON_I1",
	"SON_I2",
	"SON_J",
	"SON_Movie",
	"SUB_A",
	"SUB_A1",
	"SUB_A2",
	"SUB_A_60Hz",
	"SUB_B",
	"SUB_B1",
	"SUB_C",
	"SUB_D",
	"SUB_E",
	"SUB_EU",
	"SUB_F",
	"SUB_F1",
	"SUB_G",
	"SUB_H",
	"SUB_I",
	"SUB_Masked_DefaultPreset",
	"SUB_Story",
	"TER_A",
	"TER_B",
	"TER_C",
	"TER_C1",
	"TER_D",
	"TER_E",
	"TER_F",
	"TER_G",
	"TER_H",
	"TER_Story",
	"TER_Story_Axe",
	"TER_Story_Fight",
	"TER_Story_Hammer",
	"TER_Story_Upgraded",
	"TER_Story_Upgraded_Fight",
	"TER_Story_Upgraded_NoHelmet",
	"CYR_Story",
	"KRO_Story",
	"SEK_Story",
	"PL1_Story_NoMask",
	"SHTpa_Story",
	"SHTpa_Story_Burnt",
	"SHTpa_Story_NoProp",
	"SHTpr_Story",
	"SHTpr_Story_NoCrown",
	"SHTpr_Story_NoProp",
	"SHT_A",
	"SHT_B",
	"SHT_C",
	"SHT_D",
	"SHT_DefaultPreset_02",
	"SHT_E",
	"SHT_F",
	"SHT_G",
	"SHT_H",
	"SHT_I",
	"SHT_J",
	"NITpa_Story",
	"NITpa_Story_NoProp",
	"NITrv_Story",
	"NITrv_Story_NoProp",
	"NITrv_Story_NoProp_SoulDrain",
	"NIT_A",
	"NIT_B",
	"NIT_D",
	"NIT_DefaultPreset_02",
	"NIT_E",
	"NIT_GEARTest",
	"TRM_defaultpreset_02",
	"TRM_NoGlasses",
	"TRM_SKIN_A",
	"TRM_SKIN_B",
	"TRM_SKIN_D",
	"TRM_SKIN_E1",
	"TRM_SKIN_E2",
	"TRM_SKIN_E3",
	"TRM_SKIN_E4",
	"TRM_SKIN_E5",
	"SINpa_Story",
	"SINpa_Story_SoulDrain",
	"SINrv_Story",
	"SIN_A",
	"SIN_B",
	"SIN_D",
	"SIN_DefaultPreset_02",
	"SIN_E",
	"SIN_E1",
	"JOK_A",
	"JOK_B",
	"JOK_D",
	"JOK_DefaultPreset_02",
	"JOK_E",
	"SPA_A",
	"SPA_B",
	"SPA_B_02",
	"SPA_C",
	"SPA_D",
	"SPA_DefaultPreset_02",
	"SPA_E",
	"SHE_A",
	"SHE_B",
	"SHE_D",
	"SHE_DefaultPreset_02",
	"SHE_E",
	"SHE_Story",
	"FUJdk_Story",
	"FUJdk_Story_NoProps",
	"FUJ_A",
	"FUJ_B",
	"FUJ_C",
	"FUJ_D",
	"FUJ_DefaultPreset_02",
	"FUJ_E",
	"FUJ_Story",
	"FUJ_Story_NoProps",
	"FUJ_Story_SoulDrain",
	"ROB_D",
	"ROB_D1",
	"ROB_DefaultPreset_02",
	"ROB_Maskless",
	"ROB_SKIN_A",
	"ROB_SKIN_A1",
	"ROB_SKIN_B",
	"ROB_SKIN_B1",
	"ROB_SKIN_C",
	"MIL_A",
	"MIL_B",
	"MIL_C",
	"MIL_D",
	"MIL_DefaultPreset_02",
	"MIL_G",
	"MIL_H",
	"MIL_NoMask",
	"RAM_A",
	"RAM_A1",
	"RAM_B",
	"RAM_B1",
	"RAM_C",
	"RAM_D",
	"RAM_DefaultPreset_02",
	"RAM_E",
	"RAN_A",
	"RAN_B",
	"RAN_C",
	"RAN_D",
	"RAN_DefaultPreset_02",
	"RAN_E",
	"RAN_NoMask",
	// more weird stuff
	"LIU_Story_FireGod",
	"LIU_Tower_FireGod",

