ermaccer/MK11Hook/MK11Hook/code/mk11menu.cpp
};
const char* szStageNames[]{
	"BGND_BlackMarketAlley",
	"BGND_CyberLinKueiAssembly",
	"BGND_GorosLair",
	"BGND_KharonsShip",
	"BGND_KoliseumBeastiary",
	"BGND_KotalsKoliseum",
	"BGND_KronikaHourGlass",
	"BGND_KronikaHourGlassNT",
	"BGND_KronikaHourGlassPrehistoric",
	"BGND_KronikaHourGlassChoatian",
	"BGND_KytinnLostHive",
	"BGND_MainMenuBackground",
	"BGND_SeaOfBlood",
	"BGND_ShangTsungsIslandRuins",
	"BGND_ShaolinTrapDungeon",
	"BGND_ShinnoksBoneSepulcher",
	"BGND_ShiRaiRyuFireGarden",
	"BGND_SpecialForcesDesertCommand",
	"BGND_TankGarageBunker",
	"BGND_TarkatanWarCamp",
	"BGND_TournamentLevel",
	"BGND_TournamentLVCMB",
	"BGND_TournamentLVNRS",
	"BGND_TournamentLVCEO",
	"BGND_TournamentLVEVO",
	"BGND_TournamentLVVNY",
	"BGND_TournamentLVDRM",
	"BGND_TournamentLVCTD",
	"BGND_TournamentLVBGS",
	"BGND_TournamentLVNEC",
	"BGND_TournamentLVECT",
	"BGND_TournamentLVFKT",
	"BGND_WuShiDragonGrotto",

};
const char* szCameraModes[TOTAL_CUSTOM_CAMERAS] = {
	"Third Person",
	"Third Person #2",
	"First Person",
	"First Person Mid",
	"Injustice 2",
	"Head Perspective"
};
const char* szModifierModes[TOTAL_MODES] = {
	"Select Screen Swap",
	"Fight Init",
};
const char* szCharClasses[TOTAL_CHARACTER_CLASSES] = {
	"Base",
	"TestCharacters",
	"Generated",
	"NPCs",
};
const char* szKryptCharacters[] = {
	// place npcs first for easy access
	"CHAR_Cyrax",
	"CHAR_Sektor",
	"CHAR_FireGod",
	"CHAR_Kronika",
	// rest of the cast
	"CHAR_Baraka",
	"CHAR_Cage",
	"CHAR_Cassie",
	"CHAR_Cetrion",
	"CHAR_DVorah",
	"CHAR_ErronBlack",
	"CHAR_Jacqui",
	"CHAR_Jade",
	"CHAR_Jax",
	"CHAR_Kabal",
	"CHAR_Kano",
	"CHAR_Kitana",
	"CHAR_Kollector",
	"CHAR_Kotal",
	"CHAR_KungLao",
	"CHAR_LiuKang",
	"CHAR_Noob",
	"CHAR_Raiden",
	"CHAR_Scorpion",
	"CHAR_Skarlet",
	"CHAR_Sonya",
	"CHAR_SubZero",
	"CHAR_Terminas",
	"CHAR_Terminator",
	"CHAR_Spawn",
	"CHAR_Sindel",
	"CHAR_ShaoKahn",
	"CHAR_Rambo",
	"CHAR_Robocop",
	"CHAR_Rain",
	"CHAR_ShangTsung",
	"CHAR_Joker",
	"CHAR_Fujin",
	"CHAR_Sheeva",
	"CHAR_CyberFrost",
	"CHAR_Nightwolf",
	"CHAR_Mileena",
};

const char* szBones[] = {
	"Head",
	"Hips",
	"Jaw",
	"LeftArm",
	"LeftEye",
	"LeftFoot",
	"LeftForeArm",
	"LeftHand",
	"LeftLeg",
	"Neck",
	"Neck1",
	"Reference",
	"RightArm",
	"RightEye",
	"RightFoot",
	"RightHand",
	"RightLeg",
	"Spine",
	"Spine1",
	"Spine2",
	"Spine3",
};


int GetCamMode(const char* mode)
{
	for (int i = 0; i < TOTAL_CUSTOM_CAMERAS; i++)
	{
		if (strcmp(mode, szCameraModes[i]) == 0)
		{
			return i;
			break;
		}
	}
	return -1;
}

int GetModifierMode(const char* mode)
{
	for (int i = 0; i < TOTAL_MODES; i++)
	{
		if (strcmp(mode, szModifierModes[i]) == 0)
		{
			return i;
			break;
		}
	}
	return -1;
}

MK11Menu* TheMenu = new MK11Menu();

static void ShowHelpMarker(const char* desc)
{
	ImGui::TextDisabled("(?)");
	if (ImGui::IsItemHovered())
	{
		ImGui::BeginTooltip();
		ImGui::PushTextWrapPos(ImGui::GetFontSize() * 35.0f);
		ImGui::TextUnformatted(desc);
		ImGui::PopTextWrapPos();
		ImGui::EndTooltip();
	}

}

void MK11Menu::Initialize()
{
	orgMouse.x = GetSystemMetrics(SM_CXSCREEN) / 2;
	orgMouse.y = GetSystemMetrics(SM_CYSCREEN) / 2;

	sprintf(szCurrentCameraOption, szCameraModes[0]);
	sprintf(szCurrentModifier, szModifierModes[0]);
	sprintf(szPlayer1ModifierCharacter, szCharacters[0]);
	sprintf(szPlayer2ModifierCharacter, szCharacters[0]);
	sprintf(szStageModifierStage, szStageNames[0]);
	sprintf(szCurrentKryptCharacter, szCharacters[0]);
	sprintf(szCurrentKryptCharacterClass, szCharClasses[0]);
	sprintf(szPlayer1TagAssistCharacter, szKryptCharacters[0]);
	sprintf(szPlayer2TagAssistCharacter, szKryptCharacters[0]);
	sprintf(szAbilityReferenceChararacter, szKryptCharacters[0]);
	sprintf(szPlayer1Bone, szBones[0]);
	sprintf(szPlayer2Bone, szBones[0]);
}

void MK11Menu::Draw()
{
	ImGui::GetIO().MouseDrawCursor = true;
	ImGui::Begin(GetMK11HookVersion(), &m_bIsActive, ImGuiWindowFlags_MenuBar);

	if (ImGui::BeginMenuBar())
	{
		if (ImGui::BeginMenu("Settings"))
		{
			m_bSubmenuActive[SUBMENU_SETTINGS] = true;
			ImGui::EndMenu();
		}
		if (ImGui::BeginMenu("Help"))
		{
			if (ImGui::MenuItem("Ability Reference"))
				m_bSubmenuActive[SUBMENU_ABILITY_REFERENCE] = true;
			if (ImGui::MenuItem("Script Reference"))
				m_bSubmenuActive[SUBMENU_SCRIPT] = true;
			ImGui::EndMenu();
		}
	}
	ImGui::EndMenuBar();

	if (ImGui::BeginTabBar("##tabs"))
	{
		if (ImGui::BeginTabItem("Character Modifier"))
		{
			DrawCharacterTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Stage Modifier"))
		{
			DrawStageTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Modifiers"))
		{
			DrawModifiersTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Player Control"))
		{
			DrawPlayerTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Speed Modifier"))
		{
			DrawSpeedTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Camera Control"))
		{
			DrawCameraTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Cheats"))
		{
			DrawCheatsTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Script"))
		{
			DrawScriptTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Krypt Modifier"))
		{
			DrawKryptTab();
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Misc."))
		{
			DrawMiscTab();
			ImGui::EndTabItem();
		}
		ImGui::EndTabBar();
	}
	ImGui::End();


	if (m_bSubmenuActive[SUBMENU_ABILITY_REFERENCE])
		DrawAbilityReference();

	if (m_bSubmenuActive[SUBMENU_SCRIPT])
		DrawScriptReference();

	if (m_bSubmenuActive[SUBMENU_SETTINGS])
		DrawSettings();


}

void MK11Menu::Process()
{
	if (m_bIsFocused)
	{
		UpdateControls();
		if (m_bFreeCamMouseControl)
			UpdateMouse();
	}


}

void MK11Menu::UpdateControls()
{

	if (GetAsyncKeyState(SettingsMgr->iHookMenuOpenKey))
	{
		if (GetTickCount64() - timer <= 150) return;
		timer = GetTickCount64();
		m_bIsActive ^= 1;
	}

	if (!m_bIsActive)
	{
		if (GetAsyncKeyState(SettingsMgr->iToggleCustomCamKey))
		{
			if (GetTickCount64() - timer <= 150) return;
			timer = GetTickCount64();
			if (GetObj(PLAYER1) && GetObj(PLAYER2))
				m_bCustomCameras ^= 1;
			else
			{
				Notifications->SetNotificationTime(2500);
				Notifications->PushNotification("Custom cameras can only be activated in game!");
			}
		}
		if (GetAsyncKeyState(SettingsMgr->iResetStageInteractablesKey))
		{
			if (GetTickCount64() - timer <= 150) return;
			timer = GetTickCount64();
			if (GetObj(PLAYER1) && GetObj(PLAYER2))
				GetGameInfo()->ResetStageInteractables();
			else
			{
				Notifications->SetNotificationTime(2500);
				Notifications->PushNotification("Stage objects can only be reset in game!");
			}
		}

		if (GetAsyncKeyState(SettingsMgr->iToggleSlowMoKey))
		{
			if (GetTickCount64() - timer <= 150) return;
			timer = GetTickCount64();
			m_bSlowMotion ^= 1;
		}

		if (GetAsyncKeyState(SettingsMgr->iToggleFreezeWorldKey))
		{
			if (m_bHookDispatch)
			{
				if (GetTickCount64() - timer <= 150) return;
				timer = GetTickCount64();
				m_bFreezeWorld ^= 1;
			}

