ermaccer/MK11Hook/MK11Hook/code/mk11menu.cpp
		}
		ProcessScriptHotkeys();
	}

}

void MK11Menu::UpdateMouse()
{
	if (m_bIsActive) return;

	GetCursorPos(&curMouse);
	mouseSpeedX = curMouse.x - orgMouse.x;
	mouseSpeedY = curMouse.y - orgMouse.y;


	if (m_bIsFocused)
	{
		if (TheMenu->m_bFreeCam)
		{
			int newVal = TheMenu->camRot.Yaw;
			newVal += mouseSpeedX / mouseSens;
			TheMenu->camRot.Yaw = newVal;


			int newValY = TheMenu->camRot.Pitch;

			if (m_bFreeCamMouseInvertY) mouseSpeedY *= -1;

			newValY += mouseSpeedY / mouseSens;
			TheMenu->camRot.Pitch = newValY;
		}
	}

}

void MK11Menu::DrawCharacterTab()
{
	ImGui::TextWrapped("Select a method for replacing characters.\nSelect Screen - replaces character during selection, works with normal gamemodes.\n"
		"Fight Init - Replaces character during game loading, allows to change characters in story mode, attract, practice.");

	if (m_nCurrentCharModifier == MODIFIER_FIGHT)
		ImGui::Text("NOTE: Game modes with intros crash in fight init modifier!\n");
	if (ImGui::BeginCombo("Modifier Mode", szCurrentModifier))
	{
		for (int n = 0; n < IM_ARRAYSIZE(szModifierModes); n++)
		{
			bool is_selected = (szCurrentModifier == szModifierModes[n]);
			if (ImGui::Selectable(szModifierModes[n], is_selected))
				sprintf(szCurrentModifier, szModifierModes[n]);
			if (is_selected)
				ImGui::SetItemDefaultFocus();

		}
		ImGui::EndCombo();
	}
	m_nCurrentCharModifier = GetModifierMode(szCurrentModifier);


	ImGui::Separator();


	ImGui::Checkbox("Enable Player 1 Modifier", &m_bPlayer1Modifier);

	if (m_nCurrentCharModifier == MODIFIER_SCREEN)
	{
		ImGui::SameLine();
		ShowHelpMarker("Should work in all game modes. You'll most likely need a gamepad for tower modes when playing as NPCs.");
	}


	if (ImGui::BeginCombo("Player 1 Character", szPlayer1ModifierCharacter))
	{
		for (int n = 0; n < IM_ARRAYSIZE(szCharacters); n++)
		{
			bool is_selected = (szPlayer1ModifierCharacter == szCharacters[n]);
			if (ImGui::Selectable(szCharacters[n], is_selected))
				sprintf(szPlayer1ModifierCharacter, szCharacters[n]);
			if (is_selected)
				ImGui::SetItemDefaultFocus();

		}
		ImGui::EndCombo();
	}
	ImGui::Separator();
	ImGui::Checkbox("Enable Player 2 Modifier", &m_bPlayer2Modifier);

	if (ImGui::BeginCombo("Player 2 Character", szPlayer2ModifierCharacter))
	{
		for (int n = 0; n < IM_ARRAYSIZE(szCharacters); n++)
		{
			bool is_selected = (szPlayer2ModifierCharacter == szCharacters[n]);
			if (ImGui::Selectable(szCharacters[n], is_selected))
				sprintf(szPlayer2ModifierCharacter, szCharacters[n]);
			if (is_selected)
				ImGui::SetItemDefaultFocus();
		}
		ImGui::EndCombo();
	}
	ImGui::Separator();

}

void MK11Menu::DrawStageTab()
{
	ImGui::Checkbox("Enable Stage Modifier", &m_bStageModifier);

	if (ImGui::BeginCombo("Stage", szStageModifierStage))
	{
		for (int n = 0; n < IM_ARRAYSIZE(szStageNames); n++)
		{
			bool is_selected = (szStageModifierStage == szCameraModes[n]);
			if (ImGui::Selectable(szStageNames[n], is_selected))
				sprintf(szStageModifierStage, szStageNames[n]);
			if (is_selected)
				ImGui::SetItemDefaultFocus();

		}
		ImGui::EndCombo();
	}

	if (ImGui::Button("Reset Stage Objects"))
		GetGameInfo()->ResetStageInteractables();
}

void MK11Menu::DrawModifiersTab()
{
	if (ImGui::BeginTabBar("##modifiers"))
	{
		if (ImGui::BeginTabItem("Tag Assists"))
		{
			ImGui::Checkbox("Player 1 Tag Assist Modifier", &m_bTagAssist);


			if (ImGui::BeginCombo("Player 1 Tag Assist Character", szPlayer1TagAssistCharacter))
			{
				for (int n = 0; n < IM_ARRAYSIZE(szKryptCharacters); n++)
				{
					bool is_selected = (szPlayer1TagAssistCharacter == szKryptCharacters[n]);
					if (ImGui::Selectable(szKryptCharacters[n], is_selected))
						sprintf(szPlayer1TagAssistCharacter, szKryptCharacters[n]);
					if (is_selected)
						ImGui::SetItemDefaultFocus();

				}
				ImGui::EndCombo();
			}
			ImGui::Separator();
			ImGui::Checkbox("Player 2 Tag Assist Modifier", &m_bTagAssistP2);


			if (ImGui::BeginCombo("Player 2 Tag Assist Character", szPlayer2TagAssistCharacter))
			{
				for (int n = 0; n < IM_ARRAYSIZE(szKryptCharacters); n++)
				{
					bool is_selected = (szPlayer2TagAssistCharacter == szKryptCharacters[n]);
					if (ImGui::Selectable(szKryptCharacters[n], is_selected))
						sprintf(szPlayer2TagAssistCharacter, szKryptCharacters[n]);
					if (is_selected)
						ImGui::SetItemDefaultFocus();

				}
				ImGui::EndCombo();
			}
			ImGui::Separator();

			ImGui::Text("NOTE: Scorpion will not work unless previously loaded (eg. P2).\nIf you get load crashes enable modifier in-game then restart or rematch (when online).");
			ImGui::Text("Restart match when you toggle these in game!");
			ImGui::EndTabItem();
		}
		if (ImGui::BeginTabItem("Abilities"))
		{
			ImGui::Checkbox("Player 1 Custom Abilities", &m_bP1CustomAbilities);
			ImGui::SameLine(); ShowHelpMarker("Set these on select screen! Changing these in game might make moves locked. Hold L SHIFT to view numeric value.");
			ImGui::Separator();


			for (int i = 0; i < sizeof(m_P1Abilities) / sizeof(m_P1Abilities[0]); i++)
			{
				int val = (int)pow(2, i);
				if (GetAsyncKeyState(VK_LSHIFT))
					sprintf(textBuffer, "Ability %d (%d)", i + 1, val);
				else
					sprintf(textBuffer, "Ability %d", i + 1);

				ImGui::Checkbox(textBuffer, &m_P1Abilities[i]);

				if (i % 2 == 0)
					ImGui::SameLine();
			}


			if (GetObj(PLAYER1))
			{
				if (ImGui::Button("Get##p1"))
				{
					int abilities = GetObj(PLAYER1)->GetAbility();

					for (int i = 0; i < sizeof(m_P1Abilities) / sizeof(m_P1Abilities[0]); i++)
					{
						int id = (int)pow(2, i);
						m_P1Abilities[i] = abilities & id;
					}
				}

			}
			ImGui::Separator();
			ImGui::Checkbox("Player 2 Custom Abilities", &m_bP2CustomAbilities);
			ImGui::Separator();

			for (int i = 0; i < sizeof(m_P2Abilities) / sizeof(m_P2Abilities[0]); i++)
			{
				int val = (int)pow(2, i);
				if (GetAsyncKeyState(VK_LSHIFT))
					sprintf(textBuffer, "Ability %d (%d)##p2", i + 1, val);
				else
					sprintf(textBuffer, "Ability %d##p2", i + 1);

				ImGui::Checkbox(textBuffer, &m_P2Abilities[i]);

				if (i % 2 == 0)
					ImGui::SameLine();
			}

