ermaccer/MK11Hook/MK11Hook/code/mk11menu.cpp
	if (m_bHookDispatch)
	{
		ImGui::Checkbox("Freeze World", &m_bFreezeWorld);
		ImGui::SameLine();
		ShowHelpMarker("Hotkey - F2");
	}


	ImGui::Separator();
}

void MK11Menu::DrawCameraTab()
{
	ImGui::Checkbox("Set Camera Position", &m_bCustomCameraPos);
	ImGui::InputFloat3("X | Y | Z", &camPos.X);
	ImGui::Checkbox("Set Camera Rotation", &m_bCustomCameraRot);
	ImGui::InputInt3("Pitch | Yaw | Roll", &camRot.Pitch);

	ImGui::Checkbox("Set FOV", &m_bCustomCameraFOV);
	ImGui::InputFloat("FOV", &camFov);

	ImGui::Separator();
	ImGui::Checkbox("Enable Freecam", &m_bFreeCam);
	ImGui::SameLine(); ShowHelpMarker("Allows to move camera with certain keys.\nRequires all toggles enabled!\nYou can configure keys in .ini file.");

	if (m_bFreeCam)
	{
		if (!m_bCustomCameraPos || !m_bCustomCameraRot || !m_bCustomCameraFOV)
			ImGui::TextColored(ImVec4(1.f, 0.3f, 0.3f, 1.f), "Check rest of the Set Camera options!");

		ImGui::InputFloat("Freecam Speed", &m_fFreeCameraSpeed);
		ImGui::InputInt("Freecam Rotation Speed", &m_nFreeCameraRotationSpeed);

		ImGui::Separator();
		ImGui::Checkbox("Mouse Control", &m_bFreeCamMouseControl);

		if (m_bFreeCamMouseControl)
		{
			ImGui::SameLine();  ImGui::TextColored(ImVec4(1.f, 0.3f, 0.3f, 1.f), "This feature is not yet finished!");
			ImGui::Checkbox("Invert Y", &m_bFreeCamMouseInvertY);
			ImGui::SliderInt("Mouse Smoothness", &mouseSens, 1, 15);
		}
	}




	ImGui::Separator();
	ImGui::Checkbox("Force Camera To Move", &m_bForceCameraUpdate);
	ImGui::SameLine(); ShowHelpMarker("Check this option if you can't move camera anymore in win poses and some cinematics.");

	ImGui::Separator();

	ImGui::Checkbox("Custom Cameras", &m_bCustomCameras);

	if (GetObj(PLAYER1) && GetObj(PLAYER2))
	{

		if (ImGui::BeginCombo("Mode", szCurrentCameraOption))
		{
			for (int n = 0; n < IM_ARRAYSIZE(szCameraModes); n++)
			{
				bool is_selected = (szCurrentCameraOption == szCameraModes[n]);
				if (ImGui::Selectable(szCameraModes[n], is_selected))
					sprintf(szCurrentCameraOption, szCameraModes[n]);
				if (is_selected)
					ImGui::SetItemDefaultFocus();

			}
			ImGui::EndCombo();
		}
		m_nCurrentCustomCamera = GetCamMode(szCurrentCameraOption);
		if (m_nCurrentCustomCamera == CAMERA_1STPERSON || m_nCurrentCustomCamera == CAMERA_1STPERSON_MID)
		{
			ImGui::InputFloat("FPS Camera Offset", &m_fAdjustCustomCameraY);
			ImGui::InputFloat("FPS Up/Down Offset", &m_fAdjustCustomCameraZ);
			ImGui::InputFloat("FPS Left/Right Offset", &m_fAdjustCustomCameraX);
		}
		else if (m_nCurrentCustomCamera == CAMERA_3RDPERSON)
		{
			ImGui::InputFloat("TPP Camera Offset", &m_fAdjustCustomCameraThirdPersonY);
			ImGui::InputFloat("TPP Up/Down Offset", &m_fAdjustCustomCameraThirdPersonZ);
			ImGui::InputFloat("TPP Left/Right Offset", &m_fAdjustCustomCameraThirdPersonX);
		}
		else if (m_nCurrentCustomCamera == CAMERA_HEAD_TRACKING)
		{
			ImGui::InputFloat("Up/Down Angle Offset", &m_fAdjustCustomHeadCameraY);
			ImGui::InputFloat("Up/Down Offset", &m_fAdjustCustomHeadCameraZ);
			ImGui::InputFloat("Left/Right Offset", &m_fAdjustCustomHeadCameraX);

			ImGui::Checkbox("Don't Flip Camera", &m_bDontFlipCamera);
			ImGui::SameLine(); ShowHelpMarker("Use this option for head tracked cinematics.");
			ImGui::Checkbox("Use Player Two As Source", &m_bUsePlayerTwoAsTracker);

			ImGui::TextWrapped("Recommended to set FOV value to at least 110 to make this mode look right!");
		}
	}
	else
		ImGui::Text("Custom cameras will appear once in-game!");

}

void MK11Menu::DrawCheatsTab()
{
	ImGui::Separator();
	ImGui::Columns(2);
	ImGui::SetColumnWidth(0, 220);

	ImGui::Text("Infinite Health");
	ImGui::NextColumn();
	ImGui::Checkbox("P1##infhealth", &m_bInfiniteHealthP1);
	ImGui::SameLine();
	ImGui::Checkbox("P2##infhealth", &m_bInfiniteHealthP2);
	ImGui::NextColumn();


	ImGui::Text("Zero Health\n");
	ImGui::NextColumn();
	ImGui::Checkbox("P1##0health", &m_bNoHealthP1);
	ImGui::SameLine();
	ImGui::Checkbox("P2##0health", &m_bNoHealthP2);
	ImGui::NextColumn();


	ImGui::Text("1 Health\n");
	ImGui::NextColumn();
	ImGui::Checkbox("P1##1health", &m_bOneHealthP1);
	ImGui::SameLine();
	ImGui::Checkbox("P2##1health", &m_bOneHealthP2);
	ImGui::NextColumn();


	ImGui::Text("Infinite Offensive Bar\n");
	ImGui::NextColumn();
	ImGui::Checkbox("P1##atk", &m_bInfiniteAttackP1);
	ImGui::SameLine();
	ImGui::Checkbox("P2##atk", &m_bInfiniteAttackP2);
	ImGui::NextColumn();

	ImGui::Text("Infinite Defensive Bar\n");
	ImGui::NextColumn();
	ImGui::Checkbox("P1##def", &m_bInfiniteDefendP1);
	ImGui::SameLine();
	ImGui::Checkbox("P2##def", &m_bInfiniteDefendP2);
	ImGui::NextColumn();


	ImGui::Columns(1);
	ImGui::Separator();
	if (GetObj(PLAYER1) && GetObj(PLAYER2))
		ImGui::Text("Easy Krushing Blows");

	if (GetObj(PLAYER1))
	{
		if (ImGui::Button("Enable  P1"))
			GetObj(PLAYER1)->SetEasyKrushingBlows(true);
		ImGui::SameLine();
		if (ImGui::Button("Disable P1"))
			GetObj(PLAYER1)->SetEasyKrushingBlows(false);
	}
	if (GetObj(PLAYER1))
	{
		if (ImGui::Button("Enable  P2"))
			GetObj(PLAYER1)->SetEasyKrushingBlows(true);
		ImGui::SameLine();
		if (ImGui::Button("Disable P2"))
			GetObj(PLAYER1)->SetEasyKrushingBlows(false);
	}
	ImGui::Separator();

}

void MK11Menu::DrawKryptTab()
{
	ImGui::Text("Make sure you match the character class! It's trial & error if a character doesn't work.");
	ImGui::Text("Normal characters use Base class, while Sektor/Cyrax use NPCs. Some might not work at all.");
	ImGui::Separator();
	ImGui::Checkbox("Change Krypt Character", &m_bKryptModifier);

	if (ImGui::BeginCombo("Character Class", szCurrentKryptCharacterClass))
	{
		for (int n = 0; n < IM_ARRAYSIZE(szCharClasses); n++)
		{
			bool is_selected = (szCurrentKryptCharacterClass == szCharClasses[n]);
			if (ImGui::Selectable(szCharClasses[n], is_selected))
				sprintf(szCurrentKryptCharacterClass, szCharClasses[n]);
			if (is_selected)
				ImGui::SetItemDefaultFocus();

		}
		ImGui::EndCombo();
	}


	if (ImGui::BeginCombo("Krypt Character", szCurrentKryptCharacter))
	{
		for (int n = 0; n < IM_ARRAYSIZE(szCharacters); n++)
		{
			bool is_selected = (szCurrentKryptCharacter == szKryptCharacters[n]);
			if (ImGui::Selectable(szKryptCharacters[n], is_selected))
				sprintf(szCurrentKryptCharacter, szKryptCharacters[n]);
			if (is_selected)
				ImGui::SetItemDefaultFocus();

