ermaccer/MK11Hook/MK11Hook/code/mk11menu.cpp
		}
		break;
	default:
		break;
	}

	if (ImGui::Button("Save", { -FLT_MIN, 0 }))
	{
		Notifications->SetNotificationTime(2500);
		Notifications->PushNotification("Settings saved to MK11Hook.ini and mk11hook_user.ini!");
		eDirectX11Hook::ms_bShouldReloadFonts = true;
		SettingsMgr->SaveSettings();
	}

	ImGui::EndChild();

	ImGui::End();
}

void MK11Menu::DrawAbilityReference()
{
	ImGui::Begin("Ability Reference", &m_bSubmenuActive[SUBMENU_ABILITY_REFERENCE]);

	static int charID = 0;
	ImGui::BeginChild("##chars", { 12 * ImGui::GetFontSize(), 0 }, true);

	for (int n = 0; n < IM_ARRAYSIZE(szKryptCharacters); n++)
	{
		bool is_selected = (charID == n);
		if (ImGui::Selectable(szKryptCharacters[n], is_selected))
			charID = n;
		if (is_selected)
			ImGui::SetItemDefaultFocus();

	}

	ImGui::EndChild();

	ImGui::SameLine();
	ImGui::BeginChild("##movelist", { 0, -ImGui::GetFrameHeightWithSpacing() });

	eAbilityNameEntry ab;
	ab = eAbiltityNames::Get(szKryptCharacters[charID]);

	ImGui::LabelText("ID", "Name");
	ImGui::Separator();

	for (unsigned int i = 0; i < TOTAL_ABILITIES; i++)
	{
		if (strlen(ab.abNames[i]) > 0)
		{
			sprintf(textBuffer, "%d", i + 1);
			ImGui::LabelText(textBuffer, ab.abNames[i]);
		}

	}

	ImGui::EndChild();
	ImGui::End();
}

void MK11Menu::DrawScriptReference()
{
	ImGui::SetNextWindowPos({ ImGui::GetIO().DisplaySize.x / 2.0f, ImGui::GetIO().DisplaySize.y / 2.0f }, ImGuiCond_Once, { 0.5f, 0.5f });
	ImGui::SetNextWindowSize({ 54 * ImGui::GetFontSize(), 54 * ImGui::GetFontSize() }, ImGuiCond_Once);
	ImGui::Begin("Script Reference", &m_bSubmenuActive[SUBMENU_SCRIPT]);

	static int secID = 0;
	static const char* scriptSections[] = {
		"General",
		"Usage",
	};

	enum eScriptRef {
		GEN,
		USG,
	};

	ImGui::BeginChild("##settings", { 12 * ImGui::GetFontSize(), 0 }, true);

	for (int n = 0; n < IM_ARRAYSIZE(scriptSections); n++)
	{
		bool is_selected = (secID == n);
		if (ImGui::Selectable(scriptSections[n], is_selected))
			secID = n;
		if (is_selected)
			ImGui::SetItemDefaultFocus();
	}

	ImGui::EndChild();

	ImGui::SameLine();
	ImGui::BeginChild("##content", { 0, -ImGui::GetFrameHeightWithSpacing() });

	switch (secID)
	{
	case GEN:
		ImGui::TextWrapped("You can find script functions in the MKScript folder. Open .mko file of interest with notepad or"
			" any hex editor. To find functions that can be executed look for strings starting with 'Rx', 'pFunc','p'.");
		break;
	case USG:
		ImGui::BulletText("On Player1 - selected function will execute on Player 1 object.\nUse with character scripts or FightEngine");
		ImGui::BulletText("On Player2 - selected function will execute on Player 2 object.\nUse with character scripts or FightEngine");
		ImGui::BulletText("On Global - selected function will execute without a specified object.\nUse this with utils or functions that change hud etc.");

		ImGui::TextWrapped("Some common player functions:");
		ImGui::BulletText("BrutalityVictory1");
		ImGui::BulletText("BrutalityVictory2");
		ImGui::BulletText("EndOfRound_Winner_Taunt_1/2/3/4/5");
		ImGui::BulletText("RxMotherBug (CHAR_DVorah)");
		ImGui::BulletText("RxT800 (CHAR_Terminator)");

		ImGui::TextWrapped("Some common FightEngine.mko functions:");
		ImGui::BulletText("RxBrutalitySharedUppercut");
		ImGui::BulletText("RxIceBall");
		break;
	default:
		break;
	}

	ImGui::EndChild();

	ImGui::End();
}

void MK11Menu::DrawKeyBind(char* name, int* var)
{
	ImGui::SameLine();

	static char butName[256] = {};
	sprintf(butName, "%s##key%s", eKeyboardMan::KeyToString(*var), name);
	if (ImGui::Button(butName))
	{
		m_bPressingKey = true;
		m_pCurrentVarToChange = var;
	}

}

#ifdef _DEBUG
void MK11Menu::DrawDebug()
{
	ImGui::PushStyleVar(ImGuiStyleVar_Alpha, 0.95f);
	ImGui::SetNextWindowPos(ImVec2(10, 5));
	ImGui::Begin("devtext", nullptr, ImGuiWindowFlags_NoDecoration | ImGuiWindowFlags_NoBackground | ImGuiWindowFlags_NoNav | ImGuiWindowFlags_NoMove |
		ImGuiWindowFlags_NoInputs |ImGuiWindowFlags_NoSavedSettings |ImGuiWindowFlags_NoFocusOnAppearing | ImGuiWindowFlags_AlwaysAutoResize);

	ImGui::PopStyleVar(1);
	ImGui::Text("MK11Hook %s Debug (%.2f FPS)", MK11HOOK_VERSION, ImGui::GetIO().Framerate);
	ImGui::Text("");
	ImGui::Text("Player 1 Object: 0x%X Info: 0x%X",GetObj(PLAYER1), GetInfo(PLAYER1));
	ImGui::Text("Player 2 Object: 0x%X Info: 0x%X", GetObj(PLAYER2), GetInfo(PLAYER2));
	ImGui::Text("P1: %s", GetCharacterName(PLAYER1));
	ImGui::Text("P2: %s", GetCharacterName(PLAYER2));
	ImGui::End();
}
#endif

void MK11Menu::KeyBind(int* var, char * bindName, char * name)
{
	ImGui::LabelText("", bindName);
	DrawKeyBind(name, var);
}

bool MK11Menu::GetActiveState()
{
	return m_bIsActive;
}

void MK11Menu::RunLastScript()
{
	MKScriptVM vm(0);
	if (m_pScript->GetFunctionID(m_nHash))
	{
		switch (m_nScriptExecuteType)
		{
		case SCRIPT_P1:
			GetObj(PLAYER1)->ExecuteScript(m_pScript, m_nHash);
			break;
		case SCRIPT_P2:
			GetObj(PLAYER2)->ExecuteScript(m_pScript, m_nHash);
			break;
		case SCRIPT_GLOBAL:
			vm.BeginVar();
			vm.Set(m_pScript, m_nHash);
			vm.Run();
			break;
		default:
			break;
		}
	}
	else
	{
		Notifications->SetNotificationTime(3500);
		Notifications->PushNotification("Function %x does not exist!", m_nHash);
	}
}

void MK11Menu::RunBrutalityWatcher()
{
	MKCharacter* p1 = GetObj(PLAYER1);
	MKCharacter* p2 = GetObj(PLAYER2);

	MKScript* genericCommands = GetScript("GenericCommands.mko");

	if (!genericCommands)
		return;

	if (p2)
	{
		float life = p2->GetLife();

		if (life <= m_fBrutalityWatcherHealth)
		{
			if (!m_bBrutalityDoneP1)
			{
				MKScript* script = GetScript(szPlayer1BrutalityCharacter);
				if (script)
				{
					p2->ExecuteScript(genericCommands, HashString("ForceBackToStance"));
					p2->ExecuteScript(script, HashString(szPlayer1BrutalityFunc));
				}
				
				m_bBrutalityDoneP1 = true;
			}

		}
		else
		{
			m_bBrutalityDoneP1 = false;
		}
	}

	if (p1)
	{
		float life = p1->GetLife();

		if (life <= m_fBrutalityWatcherHealth)
		{
			if (!m_bBrutalityDoneP2)
			{
				MKScript* script = GetScript(szPlayer2BrutalityCharacter);
				if (script)
				{
					p1->ExecuteScript(genericCommands, HashString("ForceBackToStance"));
					p1->ExecuteScript(script, HashString(szPlayer2BrutalityFunc));
				}
				m_bBrutalityDoneP2 = true;
			}
		}
		else
		{
			m_bBrutalityDoneP2 = false;
		}
	}
}

void MK11Menu::ProcessScriptHotkeys()
{
	for (int i = 0; i < m_vKeyBinds.size(); i++)
	{
		if (GetAsyncKeyState(m_vKeyBinds[i].key) & 0x1)
		{
			MKScriptVM vm(0);

			MKScript* script = GetScript(m_vKeyBinds[i].scriptName);
			if (script->GetFunctionID(m_vKeyBinds[i].functionHash))
			{
				switch (m_vKeyBinds[i].type)
				{
				case SCRIPT_P1:
					GetObj(PLAYER1)->ExecuteScript(script, m_vKeyBinds[i].functionHash);
					break;
				case SCRIPT_P2:
					GetObj(PLAYER2)->ExecuteScript(script, m_vKeyBinds[i].functionHash);
					break;
				case SCRIPT_GLOBAL:
					vm.BeginVar();
					vm.Set(script, m_vKeyBinds[i].functionHash);
					vm.Run();
					break;
				default:
					break;
				}
			}
			else
			{
				Notifications->SetNotificationTime(3500);
				Notifications->PushNotification("Function %x does not exist!", m_vKeyBinds[i].functionHash);
			}
		}
	}
}

char * GetMK11HookVersion()
{
	static char buffer[512] = {};
	sprintf(buffer, "MK11Hook by ermaccer (%s)", MK11HOOK_VERSION);
	return buffer;
}
